-- Вставка жанров
INSERT INTO Genre (genre) VALUES
('Rock'),
('Pop'),
('Hip-Hop'),
('Electronic');

-- Вставка исполнителей
INSERT INTO Artists (artist) VALUES
('Би-2'),
('Макс Корж'),
('Сплин'),
('Ленинград'),
('Noize MC'),
('Земфира');

-- Связь исполнителей с жанрами
INSERT INTO Genre_Artist (genre_id, artist_id) VALUES
(1, 1),
(2, 2),
(1, 3),
(2, 4),
(3, 5),
(1, 6),
(4, 2),
(4, 6);

-- Вставка альбомов
INSERT INTO Album (release_year, album) VALUES
(2003, 'Музыкальный автозавод'),
(2019, 'Жить в кайф'),
(2005, 'Гранатовый альбом'),
(2010, 'Рок-н-Ролл'),
(2020, 'Комета');

-- Связь исполнителей с альбомами
INSERT INTO Artist_Album (artist_id, album_id) VALUES
(1, 1),
(2, 2),
(3, 3),
(4, 4),
(5, 5),
(6, 3),
(2, 4),
(6, 5);

-- Вставка треков
INSERT INTO Track (album_id, duration, track) VALUES
(1, 240, 'Полковнику никто не пишет'),
(2, 180, 'Малый повзрослел'),
(3, 210, 'Выхода нет'),
(4, 200, 'Экспонат'),
(5, 220, 'Комета'),
(1, 260, 'Молитва'),
(2, 230, 'Верните мой 2007'),
(3, 200, 'Моё сердце'),
(4, 240, 'Бабочки'),
(5, 210, 'Падший ангел'),
(1, 230, 'Високосный год'),
(2, 210, '3:0 в мою пользу');

-- Вставка сборников
INSERT INTO Collection (title, release_year) VALUES
('Лучшее от Би-2', 2015),
('Хиты Ленинград', 2018),
('Сборник №1', 2020),
('Коллекция хитов Noize MC', 2016),
('Золотая коллекция Сплина', 2017);

-- Связь сборников с треками
INSERT INTO Track_Collection (track_id, collection_id) VALUES
(1, 1),
(2, 2),
(3, 3),
(4, 4),
(5, 5),
(6, 1),
(7, 2),
(8, 3),
(9, 4),
(11, 1),
(12, 2);
